In [18]:
import pandas as pd
import numpy as np

# Sliding Window

In [19]:
data=pd.DataFrame({"Date":["2020/05/01","2020/05/02","2020/05/03","2020/05/04","2020/05/06"],"Price":[100,150,145,110,123]})

In [20]:
data

         Date  Price
0  2020/05/01    100
1  2020/05/02    150
2  2020/05/03    145
3  2020/05/04    110
4  2020/05/06    123

In [21]:
data["Next Day Price"]=np.roll(data["Price"].values,-1)

In [22]:
data

         Date  Price  Next Day Price
0  2020/05/01    100             150
1  2020/05/02    150             145
2  2020/05/03    145             110
3  2020/05/04    110             123
4  2020/05/06    123             100

In [23]:
data.drop(4,inplace=True)

In [24]:
data

         Date  Price  Next Day Price
0  2020/05/01    100             150
1  2020/05/02    150             145
2  2020/05/03    145             110
3  2020/05/04    110             123

# Standerdizing

In [25]:
data1=pd.DataFrame({"Height":[1.23,2.34,1.43,5.67,2.32,5.56],"Width":[32,32,43,43,23,56]})

In [26]:
#st
data1

   Height  Width
0    1.23     32
1    2.34     32
2    1.43     43
3    5.67     43
4    2.32     23
5    5.56     56

In [27]:
#std_data=(value-mean)/std
#manual
np.array(data1["Height"])-np.array(data1["Height"]).mean()/np.array(data1["Height"]).std()

array([-0.45798754,  0.65201246, -0.25798754,  3.98201246,  0.63201246,
        3.87201246])

In [33]:
#lambda
fun=lambda x:np.array(x)-np.array(x).mean()/np.array(x).std()
fun([2,1,3,1,2,1,3])

array([-0.22948161, -1.22948161,  0.77051839, -1.22948161, -0.22948161,
       -1.22948161,  0.77051839])

In [34]:
data_std=data1.apply(fun)

In [35]:
std=data1.apply(lambda x:np.array(x)-np.array(x).mean()/np.array(x).std())

In [36]:
std

     Height      Width
0 -0.457988  28.390454
1  0.652012  28.390454
2 -0.257988  39.390454
3  3.982012  39.390454
4  0.632012  19.390454
5  3.872012  52.390454